Revit 2024 API
Category.SubCategories Property
Returns a map containing all of the subcategories of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CategoryNameMap SubCategories { get; }
Visual Basic
Public ReadOnly Property SubCategories As CategoryNameMap
	Get
Visual C++
public:
property CategoryNameMap^ SubCategories {
	CategoryNameMap^ get ();
}
Return Value
An empty map if the category has no subcategories.
See Also
Category Class
Autodesk.Revit.DB Namespace